In [1]:
%load_ext sql
%sql mysql+mysqldb://root:my-secret-pw@127.0.0.1/testdb
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

## Warmup

In [ ]:
%%sql 
create database schoolDB;
show databases;

 * mysql+mysqldb://root:***@127.0.0.1/testdb
1 rows affected.
8 rows affected.

[('company',),
 ('information_schema',),
 ('msc2025',),
 ('mysql',),
 ('performance_schema',),
 ('schoolDB',),
 ('sys',),
 ('testdb',)]

In [47]:
%%sql
drop table if exists Students;
create table Students(
    StudentID INT AUTO_INCREMENT PRIMARY KEY,
    FirstName TEXT NOT NULL,
    LastName TEXT NOT NULL,
    Age INT NOT NULL,
    Grade TEXT NOT NULL
);
show tables

 * mysql+mysqldb://root:***@127.0.0.1/testdb
0 rows affected.
0 rows affected.
2 rows affected.

[('Students',), ('users',)]

In [48]:
%%sql
insert into Students(FirstName, LastName, Age, Grade) values 
('John', 'Doe', 15, 10),
('Jane', 'Smith', 14, 9),
('Mike', 'Lee', 16, 11);

select * from Students;

 * mysql+mysqldb://root:***@127.0.0.1/testdb
3 rows affected.
3 rows affected.

[(1, 'John', 'Doe', 15, '10'),
 (2, 'Jane', 'Smith', 14, '9'),
 (3, 'Mike', 'Lee', 16, '11')]

In [51]:
%%sql
select * from Students where Grade=10;

 * mysql+mysqldb://root:***@127.0.0.1/testdb
1 rows affected.

[(1, 'John', 'Doe', 15, '10')]

##